dasha-pn/psoc_part3/Lab_4_1_BLE_Automation_IO.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "UART_DEB.h"
#include "UART_DEB_SPI_UART.h"
#include "UART_DEB_PINS.h"
#include "UART_DEB_SPI_UART_PVT.h"
#include "UART_DEB_PVT.h"
#include "UART_DEB_BOOT.h"
#include "Digtal_Output_LED.h"
#include "Digtal_Output_LED_aliases.h"
#include "Advertising_LED.h"
#include "Advertising_LED_aliases.h"
#include "BLE_1_gatt.h"
#include "BLE_1.h"
#include "BLE_1_HAL_PVT.h"
#include "BLE_1_STACK_PVT.h"
#include "BLE_1_StackGap.h"
#include "BLE_1_StackGatt.h"
#include "BLE_1_StackGattDb.h"
#include "BLE_1_StackHostMain.h"
#include "BLE_1_StackL2cap.h"
#include "BLE_1_StackGattServer.h"
#include "BLE_1_StackGattClient.h"
#include "BLE_1_Stack.h"
#include "BLE_1_eventHandler.h"
#include "BLE_1_aios.h"
#include "CapSense.h"
#include "CapSense_Control.h"
#include "CapSense_Filter.h"
#include "CapSense_Processing.h"
#include "CapSense_Sensing.h"
#include "CapSense_Structure.h"
#include "CapSense_Tuner.h"
#include "CapSense_Configuration.h"
#include "CapSense_SensingCSD_LL.h"
#include "CapSense_RegisterMap.h"
#include "CapSense_Centroid_LL.h"
#include "SW2.h"
#include "SW2_aliases.h"
#include "SW2_Interrupt.h"
#include "Pin_SPI_SCLK.h"
#include "Pin_SPI_SCLK_aliases.h"
#include "Pin_SPI_MOSI.h"
#include "Pin_SPI_MOSI_aliases.h"
#include "SPIM.h"
#include "SPIM_PVT.h"
#include "LED_D.h"
#include "LED_D_aliases.h"
#include "Clock_1.h"
#include "Pin_SPI_SS.h"
#include "Pin_SPI_SS_aliases.h"
#include "Pin_Buttons.h"
#include "Pin_Buttons_aliases.h"
#include "PWM.h"
#include "ADC_SAR.h"
#include "Pin_Potentiometr.h"
#include "Pin_Potentiometr_aliases.h"
#include "isr_sar_adc.h"
#include "UART_DEB_SCBCLK.h"
#include "UART_DEB_tx.h"
#include "UART_DEB_tx_aliases.h"
#include "UART_DEB_rx.h"
#include "UART_DEB_rx_aliases.h"
#include "BLE_1_bless_isr.h"
#include "CapSense_ISR.h"
#include "SPIM_IntClock.h"
#include "ADC_SAR_IRQ.h"
#include "ADC_SAR_intClock.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

